### Import libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r"C:\Users\sahin\Documents\Instacart Basket Analysis"

#### Import customer data set

In [3]:
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

##### Question 4:
Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [4]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [6]:
df.shape

(206209, 10)

In [7]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

* Renaming columns:

In [13]:
df.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age'}, inplace = True)

In [14]:
df.dtypes

user_id          int64
first_name      object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

##### Question 5
Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [16]:
# checking for missing values
df.isnull().sum()

user_id             0
first_name      11259
surname             0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

* As we see above results, there are only missing values in the first_name column. Actually, we do not need this column during our analysis, so we can drop first_name column.

In [17]:
df = df.drop(columns = ['first_name'])

In [18]:
df.head()

,user_id,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
df.shape

(206209, 9)

In [24]:
# checking for duplicates
df_dup = df[df.duplicated()]
df_dup

Empty DataFrame
Columns: [user_id, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

No duplicates data

In [26]:
# checking for mixed datatypes
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

No mixed datatypes.

#### Question 6 
Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type!

In [28]:
# Importing prepared orders_products data
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', '4.8_orders_products_merge.pkl'))

In [29]:
df_ords_prods.head()

,order_id,user_id,eval_set,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,_merge,max_order,loyalty_flag,spending,spending_flag,order_frequency,order_frequency_flag
0,2539329,1,prior,1,2,8,NaN,196.0,1.0,0.0,...,77.0,7.0,9.0,both,11,Regular customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,prior,1,2,8,NaN,14084.0,2.0,0.0,...,91.0,16.0,12.5,both,11,Regular customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,prior,1,2,8,NaN,12427.0,3.0,0.0,...,23.0,19.0,4.4,both,11,Regular customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,prior,1,2,8,NaN,26088.0,4.0,0.0,...,23.0,19.0,4.7,both,11,Regular customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,prior,1,2,8,NaN,26405.0,5.0,0.0,...,54.0,17.0,1.0,both,11,Regular customer,6.367797,Low spender,20.0,Regular customer

In [30]:
df.head()

,user_id,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

** I will merge ords_prods prepared data set and customers data set on user_id column which is the key column in the two data sets.

* Firstly, I will delete the current _merge column in the ords_prods

In [33]:
df_ords_prods = df_ords_prods.drop(columns = ['_merge'])

In [34]:
df_ords_prods.head()

,order_id,user_id,eval_set,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,spending,spending_flag,order_frequency,order_frequency_flag
0,2539329,1,prior,1,2,8,NaN,196.0,1.0,0.0,Soda,77.0,7.0,9.0,11,Regular customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,prior,1,2,8,NaN,14084.0,2.0,0.0,Organic Unsweetened Vanilla Almond Milk,91.0,16.0,12.5,11,Regular customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,prior,1,2,8,NaN,12427.0,3.0,0.0,Original Beef Jerky,23.0,19.0,4.4,11,Regular customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,prior,1,2,8,NaN,26088.0,4.0,0.0,Aged White Cheddar Popcorn,23.0,19.0,4.7,11,Regular customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,prior,1,2,8,NaN,26405.0,5.0,0.0,XL Pick-A-Size Paper Towel Rolls,54.0,17.0,1.0,11,Regular customer,6.367797,Low spender,20.0,Regular customer

* Checking memory size of df_ords_prods

In [35]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32641268 entries, 0 to 32641267
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_the_week  int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
 7   product_id              float64
 8   add_to_cart_order       float64
 9   reordered               float64
 10  product_name            object
 11  aisle_id                float64
 12  department_id           float64
 13  prices                  float64
 14  max_order               int64
 15  loyalty_flag            object
 16  spending                float64
 17  spending_flag           object
 18  order_frequency         float64
 19  order_frequency_flag    object
dtypes: float64(9), int64(6), object(5)
memory usage: 5.1+ GB

* Checking memory size of df

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   surname       206209 non-null  object
 2   gender        206209 non-null  object
 3   state         206209 non-null  object
 4   age           206209 non-null  int64
 5   date_joined   206209 non-null  object
 6   n_dependants  206209 non-null  int64
 7   fam_status    206209 non-null  object
 8   income        206209 non-null  int64
dtypes: int64(4), object(5)
memory usage: 14.2+ MB

** Checking max value to see if i can reduce memory usage without hurting analysis

In [40]:
df_ords_prods['order_frequency'].max()

30.0

In [47]:
df_ords_prods['order_frequency'] = df_ords_prods['order_frequency'].astype('float16')

In [45]:
df_ords_prods['spending_flag'] = df_ords_prods['spending_flag'].astype('category')

In [46]:
df_ords_prods['spending'].max()

25005.425

In [48]:
df_ords_prods['spending'] = df_ords_prods['spending'].astype('float16')

In [52]:
df_ords_prods['max_order'].max()

100

In [49]:
df_ords_prods['max_order'] = df_ords_prods['max_order'].astype('int8')

In [50]:
df_ords_prods['aisle_id'].max()

134.0

In [51]:
df_ords_prods['aisle_id'] = df_ords_prods['aisle_id'].astype('float16')

In [54]:
df_ords_prods['product_name'] = df_ords_prods['product_name'].astype('category')

In [55]:
df_ords_prods['add_to_cart_order'].max()

145.0

In [56]:
df_ords_prods['add_to_cart_order'] = df_ords_prods['add_to_cart_order'].astype('float16')

In [57]:
df_ords_prods['order_frequency_flag'] = df_ords_prods['order_frequency_flag'].astype('category')

In [58]:
df_ords_prods['loyalty_flag'] = df_ords_prods['loyalty_flag'].astype('category')

In [60]:
df_ords_prods['days_since_prior_order'].max()

30.0

In [61]:
df_ords_prods['days_since_prior_order'] = df_ords_prods['days_since_prior_order'].astype('float16')

In [62]:
df_ords_prods['order_hour_of_day'].max()

23

In [65]:
df_ords_prods['order_hour_of_day'] = df_ords_prods['order_hour_of_day'].astype('int8')

In [66]:
df_ords_prods['orders_day_of_the_week'].max()

6

In [67]:
df_ords_prods['orders_day_of_the_week'] = df_ords_prods['orders_day_of_the_week'].astype('int8')

In [69]:
df_ords_prods['reordered'].max()

1.0

In [71]:
df_ords_prods['reordered'] = df_ords_prods['reordered'].astype('float16')

In [74]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32641268 entries, 0 to 32641267
Data columns (total 19 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_the_week  int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              float64
 7   add_to_cart_order       float16
 8   reordered               float16
 9   product_name            category
 10  aisle_id                float16
 11  department_id           float64
 12  prices                  float64
 13  max_order               int8
 14  loyalty_flag            category
 15  spending                float16
 16  spending_flag           category
 17  order_frequency         float16
 18  order_frequency_flag    category
dtypes: category(4), float16(6), float64(3), int64(3), int8(3)
memory usage: 2.4 GB

#### After completed reducing memory usage in Phyton, memory usage for the dataframe df_ords_prods reduced from 5.1 GB to 2.4 GB.  As a result, I will try to merge two data sets which are df_ords_prods and customer data sets.

In [76]:
df_merge = df_ords_prods.merge(df, on = 'user_id', indicator = True )

In [77]:
df_merge.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_frequency_flag,surname,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196.0,1.0,0.0,Soda,...,Regular customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084.0,2.0,0.0,Organic Unsweetened Vanilla Almond Milk,...,Regular customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427.0,3.0,0.0,Original Beef Jerky,...,Regular customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088.0,4.0,0.0,Aged White Cheddar Popcorn,...,Regular customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405.0,5.0,0.0,XL Pick-A-Size Paper Towel Rolls,...,Regular customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [78]:
df_merge['_merge'].value_counts(dropna = False)

both          32641268
left_only            0
right_only           0
Name: _merge, dtype: int64

*** Merging is succesful

In [81]:
df_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared data', '4.9_part1_ords_prods_customer.pkl'))